package com.lec.exercise.exam;

public class 홍민우 {
/*
[7-1] 섯다카드 20장을 포함하는 섯다카드 한 벌(SutdaDeck클래스)을 정의한 것이다. 섯다카드 20장을 담는 SutdaCard배열을 
초기화하시오. 단, 섯다카드는 1부터 10까지의 숫자가 적힌 카드가 한 쌍씩 있고, 숫자가 1, 3, 8인 경우에는 둘 중의 한 장은 
광(Kwang)이어야 한다. 즉, SutdaCard의 인스턴스변수 isKwang의 값이 true이어야 한다.'	

[7-2] 문제7-1의 SutdaDeck클래스에 다음에 정의된 새로운 메서드를 추가하고 테스트 하시오.

([주의] Math.random()를 사용하는 경우 실행결과와 다를 수 있음.)

1. 메서드명 : shuffle

   기능 : 배열 cards에 담긴 카드의 위치를 뒤섞는다. (Math.random() 사용)

   반환타입 : 없음

   매개변수 : 없음



2. 메서드명 : pick

   기능 : 배열 cards에서 지정된 위치의 SutdaCard를 반환한다.

   반환타입 : SutdaCard

   매개변수 : int index - 위치



3. 메서드명 : pick 

   기능 : 배열 cards에서 임의의 위치의 SutdaCard를 반환한다. (Math.random() 사용)

   반환타입 : SutdaCard

   매개변수 : 없음   


[7-3] 오버라이딩의 정의와 필요성에 대해서 설명하시오.

	


[7-4] 다음 중 오버라이딩의 조건으로 옳지 않은 것은? (모두 고르시오)

a. 조상의 메서드와 이름이 같아야 한다.

b. 매개변수의 수와 타입이 모두 같아야 한다.

c. 접근 제어자는 조상의 메서드보다 좁은 범위로만 변경할 수 있다.

d. 조상의 메서드보다 더 많은 수의 예외를 선언할 수 있다.


[7-5] 다음의 코드는 컴파일하면 에러가 발생한다. 그 이유를 설명하고 에러를 수정하기 위해서는 코드를
 어떻게 바꾸어야 하는가?








*/
}
